<div class="ant-card-body"><h1 type="question" class="sc-gsDKAQ jRFErt">Тестовое Задание</h1><div class="sc-dkPtRN JlXzT"><p>Необходимо разработать SPA веб-сайт с простой системой комментирования.</p>
        <h2>Задание</h2>
        <ul>
            <li>Шаблон страницы должен содержать блоки header и footer</li>
            <li>В блоке header должен быть размещен логотип компании и текстовый заголовок страницы</li>
            <li>В блоке footer должны размещаться кликабельные иконки соцсетей</li>
            <li>В теле страницы должны присутствовать:
                <ul>
                    <li>Оформленный блок со статьей-рыбой Lorem Ipsum или любой другой объемом в два абзаца</li>
                    <li>Блок добавления нового комментария, содержащий следующие поля:
                        <ul>
                            <li>Имя пользователя</li>
                            <li>Email</li>
                            <li>Заголовок комментария</li>
                            <li>Текст комментария</li>
                        </ul>
                        Предъявляемые требования к системе комментирования:
                        <ul>
                            <li>Комментарии должны храниться в БД, совместимой с MySQL</li>
                            <li>Комментарии должны валидироваться и на фронтенде, и на бекенде</li>
                            <li>Добавление нового комментария должно происходить асинхронно, без перезагрузки страницы</li>
                        </ul>
                    </li>
                    <li>Блок с историей комментариев. В истории комментариев должны отображаться все поля, используемые при добавлении комментария, а также дата добавления комментария.</li>
                </ul>
            </li>
        </ul>
        <h2>Требования к выполнению задания</h2>
        <ul>
            <li>Нельзя использовать фреймворки, определяющие общую архитектуру веб-приложения (Laravel, Symfony, Yii и другие), приложение должно быть реализовано на нативном PHP версии не ниже 8.0</li>
            <li>Нельзя использовать готовый шаблон верстки</li>
            <li>Разработанное приложение должно использовать паттерн MVC</li>
            <li>Допускается использование PHP и JS библиотек</li>
            <li>Код, написанный на языке PHP, должен быть оформлен в соотетствии с последним актуальным стандартом оформления кода PSR</li>
            <li>Используемые и реализуемые сущности должны соответствовать стандартам PSR, если таковые имеются для предметной области</li>
            <li>Все свойства и методы должны быть типизированы, при этом не должно возникать ошибок типизации. Там, где невозможно определить типы конструкциями языка, должны использоваться подсказки в док-блоках (@var, @param и @return)</li>
            <li>Приложение должно выполняться в Docker-среде</li>
            <li>Приложение должно быть передано в виде ссылки на Git-репозиторий на любом общедоступном хостинге, не требующем обязательной авторизации для просмотра и клонирования репозитория</li>
            <li>В репозитории с приложением должен находиться файл README.md, содержащий описание приложения, примечания и инструкцию по запуску приложения</li>
        </ul>
        <h2>Критерии оценки выполнения тестового задания</h2>
        <ul>
            <li>Компактность. Не в ущерб качеству задача должна быть выполнена как можно меньшим количеством кода</li>
            <li>Знание и умение применять на практике принципы и шаблоны проектирования приложений, современные подходы к разработке</li>
            <li>Знание и умение применять на практике конструкции языков PHP и JS, в том числе нововведения</li>
            <li>Аккуратность и опрятность в оформлении кода. Код не должен содержать оставленных отладочных конструкций, закомментированных блоков исполняемого кода, неиспользуемых функций, зависимостей и т. д., а также соответствовать стандартам оформления кода PSR</li>
            <li>Умение ясно формулировать решение и выражать его на языке программирования</li>
        </ul>
        <h2>Передача решения</h2>
        <p>После завершения работы над тестовым заданием нажмите кнопку "Далее" и заполните форму</p></div><div style="padding: 32px; display: flex;"><div style="flex: 1 1 0%;"></div><button background="#fff" color="#666" highlight="#40a9ff" type="button" class="ant-btn ant-btn-default ant-btn-lg sc-bdvvtL exFpjO"><span>Далее</span></button></div></div>
     